app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("title", "content", "post_type", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "daadff"], ["content", "dad"], ["post_type", "text"], ["author_id", 33], ["created_at", "2019-06-03 20:21:28.052690"], ["updated_at", "2019-06-03 20:21:28.052690"]]
---
    def create
        @post = current_user.posts.new(post_params)
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Text can wrap!"], ["updated_at", "2019-06-04 05:42:39.981482"], ["id", 72]]
---
    def update
        @post = Post.find(params[:id])

        if @post.post_type == "photo" && @post.update(post_params)

SELECT "posts".* FROM "posts"
---
    def index
        # if params[:author_id] = current_user.id
        #     @posts = Post.includes
        # else
        #     @posts = Post.all
        #     render @posts
        # end
        @posts = Post.includes(:likes, :comments, :author).all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
---
    def show
        @post = Post.find(params[:id])
        if @post.reblog_post_id
            @original_post = Post.find(@post.reblog_post_id)